Notebook purpose

- Sense-check and explore calculated salaries

In [1]:
import os
import sys
import numpy as np
import pandas as pd
sys.path.append('/Users/fgu/dev/projects/entropy')
import entropy.helpers.aws as aws
import entropy.data.cleaners as cl
import entropy.data.creators as cr

pd.set_option('display.max_rows', 120)
pd.set_option('display.max_columns', 120)
pd.set_option('max_colwidth', None)
%config InlineBackend.figure_format = 'retina'
%load_ext autoreload
%autoreload 2

In [67]:
SAMPLE = '777'
fp = f'~/tmp/entropy_{SAMPLE}.parquet'

df = aws.read_parquet(fp)
df.head(1)

,id,date,user_id,amount,desc,merchant,tag,user_female,user_postcode,user_registration_date,user_salary_range,user_yob,account_created,account_id,account_last_refreshed,account_provider,account_type,data_warehouse_date_created,data_warehouse_date_last_updated,debit,latest_balance,merchant_business_line,tag_auto,tag_manual,tag_up,ym
0,688261,2012-01-03,777,400.0,<mdbremoved> - s/o,NaN,other account,False,wa1 4,2011-07-20,20k to 30k,1969.0,2011-07-20,262916,2020-07-21 20:32:00,natwest bank,current,2014-07-18,2017-11-13,True,364.220001,non merchant mbl,transfers,other account,other account,201201

In [68]:
earnings = [
    'salary or wages \(main\)',
    'salary or wages \(other\)',
    'salary \(secondary\)',
]

pat = '|'.join(earnings)
df[df.tag_up.str.match(pat, na=False) & ~df.debit]

,id,date,user_id,amount,desc,merchant,tag,user_female,user_postcode,user_registration_date,user_salary_range,user_yob,account_created,account_id,account_last_refreshed,account_provider,account_type,data_warehouse_date_created,data_warehouse_date_last_updated,debit,latest_balance,merchant_business_line,tag_auto,tag_manual,tag_up,ym
32,688292,2012-01-25,777,-1901.329956,<mdbremoved>,NaN,earnings_income,False,wa1 4,2011-07-20,20k to 30k,1969.0,2011-07-20,262916,2020-07-21 20:32:00,natwest bank,current,2014-07-18,2020-05-19,False,364.220001,NaN,salary or wages (main),salary or wages (main),salary or wages (main),201201
64,688325,2012-02-24,777,-1901.329956,<mdbremoved>,NaN,earnings_income,False,wa1 4,2011-07-20,20k to 30k,1969.0,2011-07-20,262916,2020-07-21 20:32:00,natwest bank,current,2014-07-18,2020-05-19,False,364.220001,NaN,salary or wages (main),salary or wages (main),salary or wages (main),201202
73,688346,2012-04-25,777,-1909.969971,<mdbremoved>,NaN,earnings_income,False,wa1 4,2011-07-20,20k to 30k,1969.0,2011-07-20,262916,2020-07-21 20:32:00,natwest bank,current,2014-07-18,2020-05-19,False,364.220001,NaN,salary or wages (main),salary or wages (main),salary or wages (main),201204
126,248454,2012-05-25,777,-1909.969971,<mdbremoved>,NaN,earnings_income,False,wa1 4,2011-07-20,20k to 30k,1969.0,2011-07-20,262916,2020-07-21 20:32:00,natwest bank,current,2014-07-18,2020-05-19,False,364.220001,NaN,salary or wages (main),salary or wages (main),salary or wages (main),201205
162,248418,2012-06-25,777,-1909.770020,<mdbremoved>,NaN,earnings_income,False,wa1 4,2011-07-20,20k to 30k,1969.0,2011-07-20,262916,2020-07-21 20:32:00,natwest bank,current,2014-07-18,2020-05-19,False,364.220001,NaN,salary or wages (main),salary or wages (main),salary or wages (main),201206
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
158273,772078076,2020-05-13,578777,-149.990005,<mdbremoved> bgc,NaN,earnings_income,True,bl8 2,2020-03-29,30k to 40k,1988.0,2020-03-30,1649664,2020-08-16 20:04:00,barclays,current,2020-05-15,1900-01-01,False,266.179993,NaN,NaN,salary or wages (other),salary or wages (other),202005
158289,778603019,2020-05-23,578777,-4504.350098,<mdbremoved>,NaN,earnings_income,True,bl8 2,2020-03-29,30k to 40k,1988.0,2020-03-30,1649664,2020-08-16 20:04:00,barclays,current,2020-05-24,1900-01-01,False,266.179993,NaN,NaN,salary or wages (main),salary or wages (main),202005
158312,782043331,2020-05-28,578777,-1986.000000,<mdbremoved>,NaN,earnings_income,True,bl8 2,2020-03-29,30k to 40k,1988.0,2020-03-29,1648915,2020-08-16 20:04:00,natwest bank,current,2020-05-30,1900-01-01,False,709.489990,NaN,salary or wages (main),NaN,salary or wages (main),202005
158383,792555625,2020-06-26,578777,-2681.959961,<mdbremoved>,NaN,earnings_income,True,bl8 2,2020-03-29,30k to 40k,1988.0,2020-03-30,1649664,2020-08-16 20:04:00,barclays,current,2020-06-27,1900-01-01,False,266.179993,NaN,NaN,salary or wages (main),salary or wages (main),202006
158387,792924732,2020-06-26,578777,-1986.000000,<mdbremoved>,NaN,earnings_income,True,bl8 2,2020-03-29,30k to 40k,1988.0,2020-03-29,1648915,2020-08-16 20:04:00,natwest bank,current,2020-06-28,1900-01-01,False,709.489990,NaN,salary or wages (main),salary or wages (main),salary or wages (main),202006

In [ ]:
df.desc.str.match

In [32]:
type(r'ko')

str

In [66]:
df[df.tag.str.contains('invest', na=False)]

,id,date,user_id,amount,desc,merchant,tag,user_female,user_postcode,user_registration_date,user_salary_range,user_yob,account_created,account_id,account_last_refreshed,account_provider,account_type,data_warehouse_date_created,data_warehouse_date_last_updated,debit,latest_balance,merchant_business_line,tag_auto,tag_manual,tag_up,ym,balance
7259,6037628,2013-04-30,22777,1.00,<mdbremoved>,NaN,investment - other,True,cb4 3,2013-05-28,NaN,1980.0,2013-05-28,4149,2015-01-03 06:52:00,hsbc,current,2014-07-18,2017-11-13,True,-852.200012,NaN,transfers,investment - other,investment - other,201304,-5481.270508
7833,33823757,2014-08-01,22777,5000.00,<mdbremoved> ltd <mdbremoved>,NaN,investment - other,True,cb4 3,2013-05-28,NaN,1980.0,2013-05-28,4149,2015-01-03 06:52:00,hsbc,current,2014-09-06,2017-11-13,True,-852.200012,NaN,NaN,investment - other,investment - other,201408,-1073.630859
15667,178957058,2016-12-28,53777,36.00,"greyfriars llp greyfriars llp , initial payment - don't recognise this retailer? type: direct deb",greyfriars llp,pension or investments,True,bs4 4,2014-05-10,NaN,1989.0,2014-05-10,56724,2017-11-28 16:21:00,natwest bank,current,2017-01-03,2018-04-30,True,NaN,greyfriars llp,pension or investments,NaN,pension or investments,201612,NaN
15734,180227950,2017-01-03,53777,2.00,greyfriars llp type: direct debit - d/d,greyfriars llp,pension or investments,True,bs4 4,2014-05-10,NaN,1989.0,2014-05-10,56724,2017-11-28 16:21:00,natwest bank,current,2017-01-09,2018-04-30,True,NaN,greyfriars llp,pension or investments,NaN,pension or investments,201701,NaN
15823,183622527,2017-01-23,53777,9.00,greyfriars llp type: direct debit - d/d,greyfriars llp,pension or investments,True,bs4 4,2014-05-10,NaN,1989.0,2014-05-10,56724,2017-11-28 16:21:00,natwest bank,current,2017-01-29,2018-04-30,True,NaN,greyfriars llp,pension or investments,NaN,pension or investments,201701,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
153884,758829273,2020-04-15,573777,10.00,family equity plan,family equity plan ltd,investment - other,False,bt66 6,2020-02-24,NaN,1973.0,2020-02-24,1608612,2020-05-23 23:43:00,halifax personal banking,current,2020-04-16,1900-01-01,True,53.430000,family equity plan ltd,investment - other,NaN,investment - other,202004,-800.529663
153885,758829274,2020-04-15,573777,10.00,family equity plan,family equity plan ltd,investment - other,False,bt66 6,2020-02-24,NaN,1973.0,2020-02-24,1608612,2020-05-23 23:43:00,halifax personal banking,current,2020-04-16,1900-01-01,True,53.430000,family equity plan ltd,investment - other,NaN,investment - other,202004,-800.529663
153958,773244817,2020-05-15,573777,10.00,family equity plan,family equity plan ltd,investment - other,False,bt66 6,2020-02-24,NaN,1973.0,2020-02-24,1608612,2020-05-23 23:43:00,halifax personal banking,current,2020-05-16,1900-01-01,True,53.430000,family equity plan ltd,investment - other,NaN,investment - other,202005,-502.530029
153959,773244818,2020-05-15,573777,10.00,family equity plan,family equity plan ltd,investment - other,False,bt66 6,2020-02-24,NaN,1973.0,2020-02-24,1608612,2020-05-23 23:43:00,halifax personal banking,current,2020-05-16,1900-01-01,True,53.430000,family equity plan ltd,investment - other,NaN,investment - other,202005,-502.530029
155568,747727178,2018-07-03,578777,15.69,kickstarter.com usa amount in usd 20.00 on 02 jul visa 1.309758 final gbp amount includes non-sterling trans fee £0.42,kickstarter,pension or investments,True,bl8 2,2020-03-29,30k to 40k,1988.0,2020-03-30,1649664,2020-08-16 20:04:00,barclays,current,2020-03-31,1900-01-01,True,266.179993,kickstarter,pension or investments,NaN,pension or investments,201807,1889.679443